zephyrproject-rtos/zephyr/drivers/pinmux/stm32/pinmux_stm32g071x.h
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB14_USART3_RTS_DE_CK \
        (STM32_PINMUX_ALT_FUNC_4 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB14_TIM15_CH1 \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB14_I2C2_SDA \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PB14_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB15_SPI2_MOSI \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB15_TIM1_CH3N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB15_TIM15_CH1N \
        (STM32_PINMUX_ALT_FUNC_4 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB15_TIM15_CH2 \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB15_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC0_LPTIM1_IN1 \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC0_LPUART1_RX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC0_LPTIM2_IN1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC1_LPTIM1_OUT \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC1_LPUART1_TX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC1_TIM15_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC2_LPTIM1_IN2 \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC2_SPI2_MISO \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC2_TIM15_CH2 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC3_LPTIM1_ETR \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC3_SPI2_MOSI \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC3_LPTIM2_ETR \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC4_USART3_TX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC4_USART1_TX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC4_TIM2_CH1_ETR \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC5_USART3_RX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC5_USART1_RX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC5_TIM2_CH2 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC6_UCPD1_FRSTX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC6_TIM3_CH1 \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC6_TIM2_CH3 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC7_UCPD2_FRSTX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC7_TIM3_CH2 \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC7_TIM2_CH4 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC8_UCPD2_FRSTX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC8_TIM3_CH3 \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC8_TIM1_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC9_I2S_CKIN \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC9_TIM3_CH4 \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC9_TIM1_CH2 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC10_USART3_TX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC10_USART4_TX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC10_TIM1_CH3 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC11_USART3_RX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC11_USART4_RX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC11_TIM1_CH4 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC12_LPTIM1_IN1 \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC12_UCPD1_FRSTX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC12_TIM14_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC13_TIM1_BKIN \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC14_TIM1_BKIN2 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC15_OSC32_EN \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC15_OSC_EN \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC15_TIM15_BKIN \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD0_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD0_SPI2_NSS \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD0_TIM16_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD1_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD1_SPI2_SCK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD1_TIM17_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD2_USART3_RTS_DE_CK \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD2_TIM3_ETR \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD2_TIM1_CH1N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD3_USART2_CTS \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD3_SPI2_MISO \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD3_TIM1_CH2N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD4_USART2_RTS_DE_CK \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD4_SPI2_MOSI \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD4_TIM1_CH3N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD5_USART2_TX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD5_SPI1_MISO__I2S1_MCK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD5_TIM1_BKIN \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD6_USART2_RX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD6_SPI1_MOSI__I2S1_SD \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD6_LPTIM2_OUT \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD8_USART3_TX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD8_SPI1_SCK__I2S1_CK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD8_LPTIM1_OUT \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD9_USART3_RX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD9_SPI1_NSS__I2S1_WS \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD9_TIM1_BKIN2 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PF0_TIM14_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PF1_OSC_EN \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PF1_TIM15_CH1N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PF2_MCO \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#endif /* ZEPHYR_DRIVERS_PINMUX_STM32_PINMUX_STM32G071_H_ */

